
# Titanic Analysis

This analysis will test the acuracy of a few deep learning models.  <br /> To open this notebook in Google Colab just click on the button below.<br /><a href="https://colab.research.google.com/github/istrategy/titanicdata/blob/master/notebooks/Titanic%20Deep%20Learning.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

## Import dependencies

In [1]:
import tensorflow as tf
from sklearn.model_selection import train_test_split
from sklearn import metrics
import pandas as pd

## Load whole dataset (it will be later splitted into train, test and validation)

In [2]:
df = pd.read_csv("https://www.48hours.ai/files/titanic/titanic-all.csv")
# displays data
df.head(n=2000)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [3]:
# describe data
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.377387,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.484918,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [4]:
# make a copy of the dataframe in case we need it later
titanic_unprocessed = df.copy()

## Prepare data

In [5]:
#dropping columns that will not be used for predictions
# process_df = df.drop(["PassengerId","Name","Ticket","Cabin"], axis=1)

# passenger id will not be dropped yet 
process_df = df.drop([ "Name","Ticket","Cabin"], axis=1)

#print number of collums with null values
print (process_df.isnull().sum() )
#processed_df

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            263
SibSp            0
Parch            0
Fare             1
Embarked         2
dtype: int64

In [6]:
# As can be seen from the above table there are many null values.  
# We are going to fill null values with values

##identify mean ages
male_mean_age = process_df[process_df["Sex"]=="male"]["Age"].mean()
female_mean_age = process_df[process_df["Sex"]=="female"]["Age"].mean()
#print ("female mean age: %1.0f" %female_mean_age )
#print ("male mean age: %1.0f" %male_mean_age )
process_df.loc[ (process_df["Sex"]=="male") & (process_df["Age"].isnull()), "Age"] = male_mean_age
process_df.loc[ (process_df["Sex"]=="female") & (process_df["Age"].isnull()), "Age"] = female_mean_age

# fill fare with mean fare
mean_fare = process_df["Fare"].mean()

# cabin and embarked

process_df["Embarked"] = process_df["Embarked"].fillna("U") # U for unknown
process_df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [7]:
# Check again for null values
print (process_df.head().isnull().sum() )
#process_df

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

### Convert categorical variables to numeric values

If a variable contains male / female one hot encoding will encode it to 0 / 1

In [8]:
# the following categorical variables will be converted  sex & embarked

categorical_feature_mask = process_df.dtypes==object
# filter categorical columns using mask and turn it into a list
categorical_cols = process_df.columns[categorical_feature_mask].tolist()

In [9]:
categorical_cols.append('Pclass') # manually add Pclass it is also a categorical variable
categorical_cols

['Sex', 'Embarked', 'Pclass']

In [10]:
process_df = pd.get_dummies(process_df, columns=categorical_cols, drop_first=True)

In [11]:
values_ds = process_df.iloc[:,2:]
values_ds

,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S,Embarked_U,Pclass_2,Pclass_3
0,22.000000,1,0,7.2500,1,0,1,0,0,1
1,38.000000,1,0,71.2833,0,0,0,0,0,0
2,26.000000,0,0,7.9250,0,0,1,0,0,1
3,35.000000,1,0,53.1000,0,0,1,0,0,0
4,35.000000,0,0,8.0500,1,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...
1304,30.585228,0,0,8.0500,1,0,1,0,0,1
1305,39.000000,0,0,108.9000,0,0,0,0,0,0
1306,38.500000,0,0,7.2500,1,0,1,0,0,1
1307,30.585228,0,0,8.0500,1,0,1,0,0,1
1308,30.585228,1,1,22.3583,1,0,0,0,0,1

In [12]:
target_ds  = process_df.iloc[:,1:2]
target_ds

      Survived
0            0
1            1
2            1
3            1
4            0
...        ...
1304         0
1305         1
1306         0
1307         0
1308         0

[1309 rows x 1 columns]

# Split data in train, test and validation batches

In [13]:
train_ratio = 0.75
validation_ratio = 0.15
test_ratio = 0.10

# train is now 75% of the entire data set
# the _junk suffix means that we drop that variable completely
x_train, x_test, y_train, y_test = train_test_split(values_ds, target_ds, test_size=1 - train_ratio)

# test is now 10% of the initial data set
# validation is now 15% of the initial data set
x_val, x_test, y_val, y_test = train_test_split(x_test, y_test, test_size=test_ratio/(test_ratio + validation_ratio)) 

print(x_train, x_val, x_test)
print(y_train, y_val, y_test)

            Age  SibSp  Parch      Fare  Sex_male  Embarked_Q  Embarked_S  \
1011  12.000000      0      0   15.7500         0           0           1
1032  33.000000      0      0  151.5500         0           0           1
212   22.000000      0      0    7.2500         1           0           1
746   16.000000      1      1   20.2500         1           0           1
867   31.000000      0      0   50.4958         1           0           1
...         ...    ...    ...       ...       ...         ...         ...
847   35.000000      0      0    7.8958         1           0           0
971    6.000000      1      1   15.2458         1           0           0
613   30.585228      0      0    7.7500         1           1           0
78     0.830000      0      2   29.0000         1           0           1
577   39.000000      1      0   55.9000         0           0           1

      Embarked_U  Pclass_2  Pclass_3
1011           0         1         0
1032           0         0         0
212            0         0         1
746            0         0         1
867            0         0         0
...          ...       ...       ...
847            0         0         1
971            0         0         1
613            0         0         1
78             0         1         0
577            0         0         0

[981 rows x 10 columns]             Age  SibSp  Parch     Fare  Sex_male  Embarked_Q  Embarked_S  \
1159  28.687088      0      0   8.0500         0           0           1
213   30.000000      0      0  13.0000         1           0           1
724   27.000000      1      0  53.1000         1           0           1
247   24.000000      0      2  14.5000         0           0           1
1193  43.000000      0      1  21.0000         1           0           1
...         ...    ...    ...      ...       ...         ...         ...
1157  30.585228      0      0   0.0000         1           0           1
849   28.687088      1      0  89.1042         0           0           0
225   22.000000      0      0   9.3500         1           0           1
284   30.585228      0      0  26.0000         1           0           1
499   24.000000      0      0   7.7958         1           0           1

      Embarked_U  Pclass_2  Pclass_3
1159           0         0         1
213            0         1         0
724            0         0         0
247            0         1         0
1193           0         1         0
...          ...       ...       ...
1157           0         0         0
849            0         0         0
225            0         0         1
284            0         0         0
499            0         0         1

[196 rows x 10 columns]             Age  SibSp  Parch      Fare  Sex_male  Embarked_Q  Embarked_S  \
551   27.000000      0      0   26.0000         1           0           1
522   30.585228      0      0    7.2250         1           0           0
950   36.000000      0      0  262.3750         0           0           0
1181  30.585228      0      0   39.6000         1           0           1
287   22.000000      0      0    7.8958         1           0           1
...         ...    ...    ...       ...       ...         ...         ...
756   28.000000      0      0    7.7958         1           0           1
727   28.687088      0      0    7.7375         0           1           0
903   23.000000      1      0   82.2667         0           0           1
643   30.585228      0      0   56.4958         1           0           1
1017  22.000000      0      0    7.7958         1           0           1

      Embarked_U  Pclass_2  Pclass_3
551            0         1         0
522            0         0         1
950            0         0         0
1181           0         0         0
287            0         0         1
...          ...       ...       ...
756            0         0         1
727            0         0         1
903            0         0         0
643            0         0         1
1017           0         0         1

[132 rows x 10 columns]
      Survived
1011         1
1032         1
212          0
746          0
867          0
...        ...
847          0
971          0
613          0
78           1
577          1

[981 rows x 1 columns]       Survived
1159         1
213          0
724          1
247          1
1193         0
...        ...
1157         0
849          1
225          0
284          0
499          0

[196 rows x 1 columns]       Survived
551          0
522          0
950          1
1181         0
287          0
...        ...
756          0
727          1
903          1
643          1
1017         0

[132 rows x 1 columns]

# Deep learning on data

## First model will be a shallow network

In [14]:
import keras
from keras.datasets import mnist
from keras.models import Sequential
from keras.layers import Dense
from keras.optimizers import SGD
from matplotlib import pyplot as plt

In [15]:
# in case you do not have keras installed uncomment the bottom line
# pip install keras
#print(x_train, x_val, x_test)
#print(y_train, y_val, y_test)

In [88]:
#Shallow network setup
model = Sequential()
model.add(Dense(5, activation='tanh', input_shape=(10,)))
model.add(Dense(20, activation='sigmoid'))
model.add(Dense(1, activation='sigmoid'))

In [89]:
model.summary()

Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_69 (Dense)             (None, 5)                 55
_________________________________________________________________
dense_70 (Dense)             (None, 20)                120
_________________________________________________________________
dense_71 (Dense)             (None, 1)                 21
=================================================================
Total params: 196
Trainable params: 196
Non-trainable params: 0
_________________________________________________________________

In [90]:
model.compile(loss='mean_squared_error', optimizer=SGD(lr=0.01), metrics=['accuracy'])

In [92]:
model.fit(x_train, y_train, batch_size=3, epochs=10, verbose=1, validation_data=(x_val, y_val))

Epoch 1/10
327/327 [==============================] - 0s 1ms/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 2/10
327/327 [==============================] - 0s 1ms/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 3/10
327/327 [==============================] - 0s 942us/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 4/10
327/327 [==============================] - 0s 988us/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 5/10
327/327 [==============================] - 0s 1000us/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 6/10
327/327 [==============================] - 0s 948us/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 7/10
327/327 [==============================] - 0s 1ms/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 8/10
327/327 [==============================] - 0s 1ms/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 9/10
327/327 [==============================] - 0s 954us/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378
Epoch 10/10
327/327 [==============================] - 0s 1000us/step - loss: nan - accuracy: 0.6177 - val_loss: nan - val_accuracy: 0.6378

## Conclusion

As we can see from the above epochs. There is no improvement in accuracy or val_accuracy during the epochs.<br> <br> Perhaps a deep network is not the right tool for the Titanic data set. Deep networks work better if there are many parameters with lots of data to work with. On the 48<font style="color:#d99116;">hours</font>.ai website we've  compiled a report with different prediction models. <br><br>The report can be downloaded <a href="https://www.48hours.ai/files/Titanic_Report.pdf">here https://www.48hours.ai/files/Titanic_Report.pdf</a>.